#+TITLE: sentor's emacs config
** Which Key a successor of Guide Key
   http://ericjmritz.name/2015/09/15/recent-emacs-packages-as-of-september-2015/
   #+BEGIN_SRC emacs-lisp
     (require 'which-key)
     (which-key-mode)
     ;; show the keys on the right side like guide keys
     (which-key-setup-side-window-right)
     (setq which-key-idle-delay 0.6)

   #+END_SRC

   #+RESULTS:
   : 0.6

** key-chord
   to work, press different two characters simultaneous or the same twice
   key-chords are used in hydra
   #+BEGIN_SRC emacs-lisp
   (setq key-chord-one-key-delay 0.2)
   (key-chord-mode 1)
   #+END_SRC

   #+RESULTS:
   : Key Chord mode on

